УТ_для_edt.РасширениеСмарт/src/Documents/ЗаказНаВнутреннееПотребление/ЗаказНаВнутреннееПотребление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЗаказНаВнутреннееПотребление</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НеОтгружатьЧастями</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЖелаемаяДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Сделка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПотреблениеДляДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ФизическоеЛицо</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВариантОбеспечения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаОтгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КатегорияЭксплуатации</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АналитикаАктивовПассивов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt.РасширениеСмарт/src/Documents/ЗаказНаВнутреннееПотребление/Forms/ФормаДокумента/Module.bsl
#Область ПеренесеноСДоработками

&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//++ смарт:ММ #006 144 05.12.2019
	НастроитьВидимостьДоступностьЭлементов();
	//-- смарт:ММ 05.12.2019
	
	//++#1547 смарт: Лопато 22.03.2024 //Автоматическое заполнение серий чернил в заказах
	ЭтаФорма.Элементы.ТоварыДатаОтгрузки.УстановитьДействие("ПриИзменении", "смартТоварыДатаОтгрузкиПриИзменении");
    //--#1547 смарт: Лопато 22.03.2024
	
	//++ #Б4636 смарт: Шляпников 14.10.2025 / Заказ на внутреннее потребление. Доработка. Возможность указания Назначения.
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "ТоварыНазначение", "Товары",, 1, "Объект.Товары.Назначение",,, "ТоварыВариантОбеспечения");
	//-- #Б4636 смарт: Шляпников 14.10.2025
	
	//++ #Б6794 смарт: Шляпников 07.05.2026 / Маркировка. Корректировка алгоритма определения Обязательной маркировки в карточке Номенклатура.
	Элементы.Товары.УстановитьДействие("ПриИзменении", "смартТоварыПриИзменении");
	//-- #Б6794 смарт: Шляпников 07.05.2026
	
	//++ #6996 смарт: Тимофеева 20.07.2026 / Создавать заказ на внутреннее потребление из заказа на перемещение
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "смартПричинаВозврата", "ГруппаКомментарий",, 1, "Объект.смартПричинаВозврата",,,);
	//-- #6996 смарт: Тимофеева 20.07.2026

	//++ смарт: 24.08.2026 / Заполнить по назначению (вывод из оборота)
	смартФормированиеИнтерфейса.СоздатьКоманду(ЭтаФорма, "смартЗаполнитьПоНазначению", "Заполнить по назначению", "смартЗаполнитьПоНазначению");
	смартФормированиеИнтерфейса.СздКнопка(ЭтаФорма, "смартЗаполнитьПоНазначению", "ТоварыПодменюЗаполнить",
		"Заполнить по назначению", "смартЗаполнитьПоНазначению", 1, Новый Структура);
	//-- смарт: 24.08.2026

КонецПроцедуры

&НаКлиенте
&После("ДатаОтгрузкиПриИзменении")
Процедура смарт_ДатаОтгрузкиПриИзмененииПосле(Элемент)
	
	//++#1547 смарт: Лопато 22.03.2024 //Автоматическое заполнение серий чернил в заказах
	ЗаполнитьСтатусыУказанияСерий();
    //--#1547 смарт: Лопато 22.03.2024
	
КонецПроцедуры

&НаКлиенте
&После("ОбработкаВыбора")
Процедура смарт_ОбработкаВыбораПосле(ВыбранноеЗначение, ИсточникВыбора)
	
	//++#1547 смарт: Лопато 22.03.2024 //Автоматическое заполнение серий чернил в заказах
	смартОбщегоНазначенияКлиент.смартПроверитьПоказатьПредупреждениеПоСериям(ВыбранноеЗначение, ИсточникВыбора);
	//--#1547 смарт: Лопато 22.03.2024
	
	//++ #Б6794 смарт: Шляпников 07.05.2026 / Маркировка. Корректировка алгоритма определения Обязательной маркировки в карточке Номенклатура.
	ЗаполнитьДанныеОМаркировкеНоменклатуры();
	//-- #Б6794 смарт: Шляпников 07.05.2026
	
КонецПроцедуры

&НаСервере
&После("НеОтгружатьЧастямиПриИзмененииСервер")
Процедура смарт_НеОтгружатьЧастямиПриИзмененииСерверПосле()
	
	//++#1547 смарт: Лопато 22.03.2024 //Автоматическое заполнение серий чернил в заказах
	ЗаполнитьСтатусыУказанияСерий();
	//--#1547 смарт: Лопато 22.03.2024
	
КонецПроцедуры

&НаКлиенте
&Перед("ТоварыВыбор")
Процедура смарт_ТоварыВыборПеред(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	//++#1547 смарт: Лопато 22.03.2024 //Автоматическое заполнение серий чернил в заказах
	смартОбщегоНазначенияКлиент.смартПроверитьУстановитьДоступностьТоварыСерия(Элемент, Элементы.ТоварыСерия, Элементы.Товары.ТекущиеДанные);
	//--#1547 смарт: Лопато 22.03.2024
	
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ПослеЗаписи")
Процедура смарт_ПослеЗаписи(ПараметрыЗаписи)

	ОповеститьОПроведенииДокумента(ПараметрыЗаписи);

	МодификацияКонфигурацииКлиентПереопределяемый.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);

	ОбщегоНазначенияУТКлиент.ВыполнитьДействияПослеЗаписи(ЭтаФорма, Объект, ПараметрыЗаписи);

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	#Вставка
	//++ #Б3790 смарт: Шляпников 12.08.2025 / Маркировка радиоэлектронной продукции. Доработка документов
	Если НЕ Объект.смартЗапчастиГарантийные Тогда
		смартМаркировкаКлиент.ВывестиПредупреждениеОНаличииТоваровСМаркировкой(Объект);
	КонецЕсли;
	//-- #Б3790 смарт: Шляпников 12.08.2025
	
	//++ #Б6778 смарт: Шляпников 04.05.2026 / Маркировка товара. Экспериментальный режим маркировки.
	Если НЕ Объект.смартЗапчастиГарантийные Тогда
		смартМаркировкаКлиент.ВывестиСообщениеОНаличииТоваровСЭкспериментальнойМаркировкой(Объект);
	КонецЕсли;
	//-- #Б6778 смарт: Шляпников 04.05.2026
	
	//++ #Б6794 смарт: Шляпников 07.05.2026 / Маркировка. Корректировка алгоритма определения Обязательной маркировки в карточке Номенклатура.
	ЗаполнитьДанныеОМаркировкеНоменклатуры();
	//-- #Б6794 смарт: Шляпников 07.05.2026
	#КонецВставки

КонецПроцедуры

#КонецОбласти

#Область ДоработкиСмарт

//++ смарт:ММ #006 144 05.12.2019
Процедура НастроитьВидимостьДоступностьЭлементов()
	
	смартОбщегоНазначения.НастроитьВидимостьЭлементовФормы(ЭтаФорма);	
	
КонецПроцедуры //-- смарт:ММ 05.12.2019

//++#1547 смарт: Лопато 22.03.2024 //Автоматическое заполнение серий чернил в заказах
&НаКлиенте
Процедура смартТоварыДатаОтгрузкиПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПроверитьЗаполнитьОбеспечение", Новый Структура("ЗаполнитьОбособленно", Ложь));
	СтруктураДействий.Вставить("ЗаполнитьВариантОбеспеченияПоДатеОтгрузки",
		ОбеспечениеКлиентСервер.СтруктураЗаполненияВариантаОбеспечения(Объект, ТекущаяСтрока.ДатаОтгрузки));
	СтруктураДействий.Вставить("ПроверитьСериюРассчитатьСтатус", Новый Структура("Склад, ПараметрыУказанияСерий", Объект.Склад, ПараметрыУказанияСерий));
	СтруктураДействий.Вставить("ПриИзмененииТипаНоменклатурыИлиВариантаОбеспечения",
		Новый Структура("ЕстьРаботы, ЕстьОтменено", Ложь, Истина));
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	ОбеспечениеКлиент.ЗаполнитьСлужебныеРеквизиты(Объект.Товары, ДатаОтгрузкиОбязательна, СкладОбязателен);

КонецПроцедуры //--#1547 смарт: Лопато 22.03.2024

//++#1547 смарт: Лопато 22.03.2024 //Автоматическое заполнение серий чернил в заказах
&НаСервере
Процедура ЗаполнитьСтатусыУказанияСерий()
	
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
	
КонецПроцедуры //--#1547 смарт: Лопато 22.03.2024

//++ #6676  смарт: Тимофеева 27.04.2026 / Маркировка радиоэлектронной продукции. Запрет проведения документа Заказ на внутреннее потребление.
&НаСервере
&ИзменениеИКонтроль("ПередЗаписьюНаСервере")
Процедура смарт_ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства

	МодификацияКонфигурацииПереопределяемый.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборот.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
	#Вставка
	ТекстСообщения = "";
	Если НЕ Объект.смартЗапчастиГарантийные Тогда
		ТекстОшибки = смартМаркировка.ПроверитьВозможностьВнутреннегоПотребления(ТекущийОбъект, ТекстСообщения);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,,, Отказ);
	КонецЕсли; 
	
	//++ #6996 смарт: Тимофеева 20.07.2026 / Создавать заказ на внутреннее потребление из заказа на перемещение  
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение
		И Объект.Склад = Справочники.смартПредопределенныеЗначения.СкладПросрочкиНеликвид.Значение
		И НЕ ЗначениеЗаполнено(Объект.смартПричинаВозврата) Тогда
		ОбщегоНазначения.СообщитьПользователю("Укажите причину возврата",,,"Объект.смартПричинаВозврата", Отказ);
		Элементы["смартПричинаВозврата"].ОтметкаНезаполненного = Истина;
	КонецЕсли;
	//-- #6996 смарт: Тимофеева 20.07.2026
	#КонецВставки
КонецПроцедуры
//-- #6676  смарт: Тимофеева 27.04.2026 

//++ #Б6794 смарт: Шляпников 07.05.2026 / Маркировка. Корректировка алгоритма определения Обязательной маркировки в карточке Номенклатура.
&НаСервере
Процедура ЗаполнитьДанныеОМаркировкеНоменклатуры()
	
	смартМаркировка.ЗаполнитьИнформациюОМаркировкеВТаблицуНоменклатуры(Объект.Товары);
	
КонецПроцедуры

//++ #Б6794 смарт: Шляпников 07.05.2026 / Маркировка. Корректировка алгоритма определения Обязательной маркировки в карточке Номенклатура.
&НаКлиенте
Процедура смартТоварыПриИзменении(Элемент)

	ЗаполнитьДанныеОМаркировкеНоменклатуры();

КонецПроцедуры

//++ смарт: 24.08.2026 / Заполнить по назначению (вывод из оборота)
&НаКлиенте
Процедура смартЗаполнитьПоНазначению(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Склад) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Укажите склад.'"),
			,
			"Объект.Склад");
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Склад", Объект.Склад);
	ПараметрыФормы.Вставить("смартЗапчастиГарантийные", Объект.смартЗапчастиГарантийные);
	ПараметрыФормы.Вставить("ДокументВладелец", Объект.Ссылка);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("смартЗаполнитьПоНазначениюЗавершение", ЭтотОбъект);
	ОткрытьФорму(
		"Обработка.смартЗаполнениеТоваровПоНазначению.Форма.Форма",
		ПараметрыФормы,
		ЭтотОбъект,
		,
		,
		,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура смартЗаполнитьПоНазначениюЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	смартЗаполнитьПоНазначениюНаСервере(Результат);
	
	ОбеспечениеКлиент.ЗаполнитьСлужебныеРеквизиты(Объект.Товары, ДатаОтгрузкиОбязательна, СкладОбязателен);
	МногооборотнаяТараКлиент.ОбновитьСостояниеЗаполненияМногооборотнойТары(Объект.СостояниеЗаполненияМногооборотнойТары);
	ЗаполнитьДанныеОМаркировкеНоменклатуры();
	
КонецПроцедуры

&НаСервере
Процедура смартЗаполнитьПоНазначениюНаСервере(Знач АдресВХранилище)
	
	ТаблицаПереноса = ПолучитьИзВременногоХранилища(АдресВХранилище);
	Если ТипЗнч(ТаблицаПереноса) <> Тип("ТаблицаЗначений") Тогда
		Возврат;
	КонецЕсли;
	
	ПарамСтатьи = Новый Структура;
	ПарамСтатьи.Вставить("Организация", Объект.Организация);
	ПарамСтатьи.Вставить("Подразделение", Объект.Подразделение);
	ПарамСтатьи.Вставить("ХозяйственнаяОперация", Объект.ХозяйственнаяОперация);
	
	КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	
	Для Каждого СтрокаПереноса Из ТаблицаПереноса Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура", СтрокаПереноса.Номенклатура);
		Отбор.Вставить("Назначение", СтрокаПереноса.Назначение);
		
		Если Объект.Товары.НайтиСтроки(Отбор).Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ТекущаяСтрока = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтрокаПереноса, "Номенклатура, Назначение");
		ПриДобавлениСтрокиТоваров(ТекущаяСтрока);
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущаяСтрока.Характеристика);
		СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
		СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
		СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", ТекущаяСтрока.Упаковка);
		ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий);
		СтруктураДействий.Вставить("ЗаполнитьСтатьюАналитикуРасходовПоУмолчанию", ПарамСтатьи);
		СтруктураДействий.Вставить("ПроверитьСериюРассчитатьСтатус",
			Новый Структура("Склад, ПараметрыУказанияСерий", Объект.Склад, ПараметрыУказанияСерий));
		СтруктураДействий.Вставить("ЗаполнитьПризнакАналитикаРасходовОбязательна");
		СтруктураДействий.Вставить("ПроверитьЗаполнитьОбеспечение", Новый Структура("ЗаполнитьОбособленно", Ложь));
		СтруктураДействий.Вставить("ПроверитьЗаполнитьНазначение");
		СтруктураДействий.Вставить("ПриИзмененииТипаНоменклатурыИлиВариантаОбеспечения",
			Новый Структура("ЕстьРаботы, ЕстьОтменено", Ложь, Истина));
		СтруктураДействий.Вставить("НоменклатураПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
			ЭтаФорма.ИмяФормы, "Товары"));
		
		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
		
	КонецЦикла;
	
	ЗаполнитьСлужебныеРеквизитыПоНоменклатуре();
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
	МногооборотнаяТараСервер.ОбновитьСостояниеЗаполненияМногооборотнойТары(Объект.СостояниеЗаполненияМногооборотнойТары);
	
	Модифицированность = Истина;
	
КонецПроцедуры
//-- смарт: 24.08.2026

#КонецОбласти
